from sys import stdin
input = stdin.readline

#학창시절 풀이 그냥 빼다 박아버린 거 진짜 제일 빠름ㅇㅇ
#하지만 1번 2번 의 장점은 확장성의 용이 해당 코드의 경우
#만약에 K가지 이상의 개수를 구하라? 하고 주어지면 적은 수의 경우 빠를지언정
#수가 방대해지면 재귀 돌아서 그냥 하나씩 다 체크하는게 더 빠름
#이 코드의 경우 지금 K가지 한가지의 경우라 이렇게 빠르게 처리할 수 있지만
#K가지 이상 구하라 해버리면 계속 늘어나가지고 비효율적임
#실사례로 이용하거나 문제 풀이에 용이한 코드는 1번 카피 코드가 되겠습니다. 땅땅
N, K = map(int,input().split())
x,  y = 1, 1

for i in range(K):
    x *= N
    N -= 1
    
for i in range(2, K + 1):
    y *= i

print((x // y) % 10007)



'''
\(N\)과 정수 \(K\)가 주어졌을 때 이항 계수 
\(\binom{N}{K}\)를 10,007
예제 입력 1 
5 2
예제 출력 1 
10
'''