num = 0
b = 0
c = 0
for i in range(9):
    a = list(map(int,input().split()))
    for j in range(9):
        if a[j] >= num :
            num = a[j]
            b = i+1
            c = j+1
print(num)
print("{0} {1}".format(b,c))
            
        


'''
9 x 9 입력 0 <= n < 100
첫줄 최대값 출력
둘줄 최대값의 "i행 j열" 
최댓값이 두 개 이상인 경우 그 중 한 곳의 위치를 출력 이 말은 결국 중복 신경 x
예제 입력 1 
3 23 85 34 17 74 25 52 65
10 7 39 42 88 52 14 72 63
87 42 18 78 53 45 18 84 53
34 28 64 85 12 16 75 36 55
21 77 45 35 28 75 90 76 1
25 87 65 15 28 11 37 28 74
65 27 75 41 7 89 78 64 39
47 47 70 45 23 65 3 41 44
87 13 82 38 31 12 29 29 80
예제 출력 1 
90
5 7
'''